# Week 3 Wrap-Up Exercises

**Note**: 

> This exercise has been written out in something called a Jupyter Notebook. We'll discuss Jupyter Notebooks in more detail later in this specialization—they are very a powerful tool for data science communication!—but for the time being, the notebook is just a convenient way for us to write out the exercise. You don't need to *do* anything with the notebook except read its contents—just use write your Python code in a regular `.py` file.

**WARNING:**

> When asked to round your answers to a certain number of decimals, do *not* round any results until you've finished your computations and have your final answer! For example, if you were to calculate the average hourly wage for workers, and you did so by first calculating the average weekly salary of workers and the average hours worked per week, then divided the first number by the second, you should NOT round the average weekly salary of workers or the average hours worked per week. Rounding intermediate results can lead to compounding errors that cause problems for the autograder.


In this exercise, we'll be returning to the American Community Survey data we used previously to measuring racial income inequality in the United States. In today's exercise, we'll be using it to measure the returns to education and how those returns vary by race and gender.

## Exercises

### Exercise 1

For these cleaning exercises, we'll return to the ACS data we've used before one last time. We'll be working with `US_ACS_2017_10pct_sample.dta`. Please load it.

In [1]:
import pandas as pd
import numpy as np

df = pd.read_stata("US_ACS_2017_10pct_sample.dta")

df.head()

,year,datanum,serial,cbserial,numprec,subsamp,hhwt,hhtype,cluster,adjust,...,migcounty1,migmet131,vetdisab,diffrem,diffphys,diffmob,diffcare,diffsens,diffeye,diffhear
0,2017,1,177686,2.017001e+12,9,64,55,"female householder, no husband present",2.017002e+12,1.011189,...,0,not in identifiable area,n/a,n/a,n/a,n/a,n/a,no vision or hearing difficulty,no,no
1,2017,1,1200045,2.017001e+12,6,79,25,"male householder, no wife present",2.017012e+12,1.011189,...,0,not in identifiable area,n/a,no cognitive difficulty,no ambulatory difficulty,no independent living difficulty,no,no vision or hearing difficulty,no,no
2,2017,1,70831,2.017000e+12,1 person record,36,57,"male householder, living alone",2.017001e+12,1.011189,...,0,not in identifiable area,n/a,has cognitive difficulty,no ambulatory difficulty,no independent living difficulty,no,no vision or hearing difficulty,no,no
3,2017,1,557128,2.017001e+12,2,10,98,married-couple family household,2.017006e+12,1.011189,...,0,not in identifiable area,n/a,no cognitive difficulty,no ambulatory difficulty,no independent living difficulty,no,no vision or hearing difficulty,no,no
4,2017,1,614890,2.017001e+12,4,96,54,married-couple family household,2.017006e+12,1.011189,...,0,not in identifiable area,n/a,n/a,n/a,n/a,n/a,no vision or hearing difficulty,no,no

### Exercise 2

For our exercises today, we'll focus on `age`, `sex`, `educ` (education), and `inctot` (total income). Subset your data to those variables, and quickly look at a sample of 10 rows.

In [2]:
df2 = df[['age', 'sex', 'educ', 'inctot']]

df2

       age     sex                       educ   inctot
0        4  female  nursery school to grade 4  9999999
1       17  female                   grade 11     6000
2       63    male         4 years of college     6150
3       66  female                   grade 12    14000
4        1    male        n/a or no schooling  9999999
...     ..     ...                        ...      ...
318999  33  female         4 years of college    22130
319000   4  female  nursery school to grade 4  9999999
319001  20    male                   grade 12     5000
319002  47    male        5+ years of college   240000
319003  33    male        5+ years of college    48000

[319004 rows x 4 columns]

In [3]:
df2.sample(10)

       age     sex                 educ   inctot
58299   72    male   4 years of college    25200
112507  60  female   2 years of college    45300
169273   2    male  n/a or no schooling  9999999
253291  17  female             grade 10        0
255033  39  female    1 year of college        0
242970  45    male   2 years of college    34000
197875  33    male  5+ years of college     5360
68033   74  female             grade 12     6500
270167  50    male             grade 12    50000
300269  16    male             grade 10        0

### Exercise 3

As before, all the values of `9999999` have the potential to cause us real problems, so replace all the values of `inctot` that are `9999999` with `np.nan`.

In [4]:
df2 = df2.copy()  # Ensures df2 is a separate DataFrame
df2['inctot'] = df2['inctot'].replace(9999999, np.nan)

### Exercise 4

Attempt to calculate the average age of people in our data. What do you get? Why are you getting that error?

In [5]:
df2["age"].mean()

TypeError: 'Categorical' with dtype category does not support reduction 'mean'

### Exercise 5

We want to be able to calculate things using age, so we need it to be a numeric type. Check the current type of `age`, and look at all the values of `age` to figure out why it's categorical and not numeric. You should find two problematic categories. What are those categories?

In [6]:
df2["age"].dtype

CategoricalDtype(categories=['less than 1 year old', '1', '2', '3', '4', '5', '6', '7',
                  '8', '9', '10', '11', '12', '13', '14', '15', '16', '17',
                  '18', '19', '20', '21', '22', '23', '24', '25', '26', '27',
                  '28', '29', '30', '31', '32', '33', '34', '35', '36', '37',
                  '38', '39', '40', '41', '42', '43', '44', '45', '46', '47',
                  '48', '49', '50', '51', '52', '53', '54', '55', '56', '57',
                  '58', '59', '60', '61', '62', '63', '64', '65', '66', '67',
                  '68', '69', '70', '71', '72', '73', '74', '75', '76', '77',
                  '78', '79', '80', '81', '82', '83', '84', '85', '86', '87',
                  '88', '89', '90 (90+ in 1980 and 1990)', '91', '92', '93',
                  '94', '95', '96'],
, ordered=True)

### Exercise 6

In order to convert `age` into a numeric variable, we need to replace those problematic entries with values that `pandas` can later convert into numbers. Pick appropriate substitutions for the existing values and replace the current values. 

**Hint 1:** Categorical variables act like strings, so you might want to use string methods! 

**Hint 2:** Remember that characters like parentheses, pluses, asterisks, etc. are special in Python strings, and you have to escape them if you want them to be interpreted literally!

**Hint 3:** Because the US Census has been conducted regularly for hundreds of years but exactly how the census has been conducted has occasionally changed, variables are sometimes coded in a way that might be interpreted in different ways for different census years. For example, hypothetically, one might write `90 (90+ in 1980 and 1990)` if the Censuses conducted in 1980 and 1990 used to top-code age at 90 (any values *over* 90 were just coded as 90), but more recent Censuses no longer top-coded age and recorded ages over 90 as the respondent's actual age. We're only working with more recent data, so anyone with a value of `90 (90+ in 1980 and 1990)` can safely be assumed to be 90 years old.

In [7]:
df2['age'] = df2['age'].replace({
    'less than 1 year old': '0',
    '90 (90+ in 1980 and 1990)': '90'
})

### Exercise 7

Now convert age from a Categorical to numeric. Calculate the average age in this data. Round your answer to 1 decimal place.

In [8]:
df2['age'] = pd.to_numeric(df2['age'])

In [9]:
df2['age'].mean().round(1)

41.3

### Exercise 8

Let's now filter out anyone in our data whose age is less than 18. Note that before made `age` a numeric variable, we couldn't do this! 

Calculate the new average age. Round your answer to 1 decimal place.

Use this sample of people 18 and over for all subsequent exercises.

In [10]:
df3 = df2[df2['age'] >= 18]

df3

        age     sex                 educ    inctot
2        63    male   4 years of college    6150.0
3        66  female             grade 12   14000.0
5        50    male             grade 12   50000.0
6        82    male    1 year of college   27100.0
10       47    male  n/a or no schooling   18000.0
...     ...     ...                  ...       ...
318998   31  female  5+ years of college       0.0
318999   33  female   4 years of college   22130.0
319001   20    male             grade 12    5000.0
319002   47    male  5+ years of college  240000.0
319003   33    male  5+ years of college   48000.0

[253034 rows x 4 columns]

In [11]:
df3["age"].mean().round(1)

49.8

### Exercise 9

Create an indicator variable for whether each person has *at least* a college Bachelor's degree called `college_degree`. Use this variable to calculate **the number of respondents in the dataset** with a college degree. You may assume that to get a college degree you need to complete at least 4 years of college (and if you're not from the US: college begins after completing Grade 12).

In [12]:
df3["educ"].unique()

['4 years of college', 'grade 12', '1 year of college', 'n/a or no schooling', '2 years of college', ..., 'grade 5, 6, 7, or 8', 'grade 9', 'grade 11', 'grade 10', 'nursery school to grade 4']
Length: 11
Categories (11, object): ['n/a or no schooling' < 'nursery school to grade 4' < 'grade 5, 6, 7, or 8' < 'grade 9' ... '1 year of college' < '2 years of college' < '4 years of college' < '5+ years of college']

In [13]:
df3 = df3.copy()
df3['college_degree'] = df3['educ'].isin(['4 years of college', '5+ years of college']).astype(int)

In [14]:
df3.head()

    age     sex                 educ   inctot  college_degree
2    63    male   4 years of college   6150.0               1
3    66  female             grade 12  14000.0               0
5    50    male             grade 12  50000.0               0
6    82    male    1 year of college  27100.0               0
10   47    male  n/a or no schooling  18000.0               0

In [15]:
df3["college_degree"].sum()

77013

### Exercise 10

Let's examine how the educational gender gap. Use `pd.crosstab` to create a cross-tabulation of `sex` and `college_degree`. `pd.crosstab` will give you the number of people who have each combination of `sex` and `college_degree` (so in this case, it will give us a 2x2 table with Male and Female as rows, and `college_degree` True and False as columns, or vice versa.

In [16]:
edu_gender_gap = pd.crosstab(df3['sex'], df3['college_degree'])
print(edu_gender_gap)

college_degree      0      1
sex
male            85821  36181
female          90200  40832

### Exercise 11

Counts are kind of hard to interpret. `pd.crosstab` can also normalize values to give percentages. Look at the `pd.crosstab` help file to figure out how to normalize the values in the table. Normalize them so that you get the share of men with and without college degree, and the share of women with and without college degrees.

What share (between 0 and 1) of men have college degrees in this data? Round your answer to three decimal places.

What share of women have college degrees in this data? Round your answer to three decimal places.

In [17]:
edu_gender_gap_percentage = pd.crosstab(df3['sex'], df3['college_degree'], normalize='index') * 100
edu_gender_gap_percentage.columns = ['No College Degree (%)', 'Has College Degree (%)']
print(edu_gender_gap_percentage)

        No College Degree (%)  Has College Degree (%)
sex
male                70.343929               29.656071
female              68.838146               31.161854

In [18]:
share_men_college = round(edu_gender_gap_percentage.loc['male', 'Has College Degree (%)'] / 100, 3)
share_women_college = round(edu_gender_gap_percentage.loc['female', 'Has College Degree (%)'] / 100, 3)

print("Share of men with a college degree:", share_men_college)
print("Share of women with a college degree:", share_women_college)

Share of men with a college degree: 0.297
Share of women with a college degree: 0.312

### Exercise 12

Now, let's recreate that table for people who are 40 and over and people under 40. 

Among the older cohort (those 40 and over), is the share of men who have college degrees greater than the share of women who have college degrees?

Among the younger cohort (those under 40), is the share of men who have college degrees greater than the share of women who have college degrees?

What does this suggest about how educational attainment is changing over time in the United States?